#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_role.role-launch-ec2: Refreshing state... [id=prod-role-launch-instance]
data.aws_availability_zones.all: Reading...
aws_vpc.main: Refreshing state... [id=vpc-0dcee13c71f063543]
data.aws_availability_zones.all: Read complete after 0s [id=us-east-1]
aws_iam_instance_profile.ec2-instance-profile: Refreshing state... [id=prod-iam-instance-profile]
aws_subnet.private-subnet[4]: Refreshing state... [id=subnet-0ef79d34b13425a88]
aws_subnet.private-subnet[1]: Refreshing state... [id=subnet-060a1313ea73b34d1]
aws_subnet.public-subnet[0]: Refreshing state... [id=subnet-0aa05051bfa7feef5]
aws_internet_gateway.igw: Refreshing state... [id=igw-0af35376874190c30]
aws_subnet.private-subnet[2]: Refreshing state... [id=subnet-0f37ba5b6d495edfc]
aws_subnet.private-subnet[3]: Refreshing state... [id=subnet-0897e77d270f6214b]
aws_subnet.public-subnet[1]: Refreshing state... [id=subnet-044ba473937913edc]
aws_security_group.sg: Refreshing state... [id=sg-0f84910f03ed7e1da]
aws_subnet.private-subnet[5]: Refreshing state... [id=subnet-048b788eb8474ab21]
aws_subnet.private-subnet[0]: Refreshing state... [id=subnet-015a7bdb7aa2ad0e7]
aws_subnet.public-subnet[4]: Refreshing state... [id=subnet-0765a747d29bb6fe9]
aws_subnet.public-subnet[2]: Refreshing state... [id=subnet-072158ae7b7d1bdc6]
aws_subnet.public-subnet[3]: Refreshing state... [id=subnet-04a613d851d85233b]
aws_subnet.public-subnet[5]: Refreshing state... [id=subnet-0e8a3f0b6eb3ded9f]
aws_route.public_subnets_igw[0]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_route.public_subnets_igw[5]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_route.public_subnets_igw[2]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_route.public_subnets_igw[1]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_route.public_subnets_igw[3]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_route.public_subnets_igw[4]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_launch_configuration.alc: Refreshing state... [id=prod-remix-recipe-launch-configuration]
aws_elb.elb: Refreshing state... [id=prod-remix-recipe-load-balancer]
aws_route_table_association.public_subnets_association[5]: Refreshing state... [id=rtbassoc-0d6532c379cc5eee7]
aws_route_table_association.public_subnets_association[0]: Refreshing state... [id=rtbassoc-0e01d27c252c6cc27]
aws_route_table_association.public_subnets_association[1]: Refreshing state... [id=rtbassoc-03b4862c5531e112e]
aws_route_table_association.public_subnets_association[2]: Refreshing state... [id=rtbassoc-0c92e5dadcc0edc86]
aws_route_table_association.public_subnets_association[3]: Refreshing state... [id=rtbassoc-0eade0005b29df706]
aws_route_table_association.public_subnets_association[4]: Refreshing state... [id=rtbassoc-0754fe23725f6f60e]
aws_autoscaling_group.asg: Refreshing state... [id=prod-remix-recipe-auto-scaling-group]
aws_autoscaling_attachment.asg_elb: Refreshing state... [id=prod-remix-recipe-auto-scaling-group-20230208201928312900000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_elb must be replaced
-/+ resource "aws_autoscaling_attachment" "asg_elb" {
      ~ autoscaling_group_name = "prod-remix-recipe-auto-scaling-group" -> (known after apply) # forces replacement
      ~ id                     = "prod-remix-recipe-auto-scaling-group-20230208201928312900000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_autoscaling_group.asg must be replaced
+/- resource "aws_autoscaling_group" "asg" {
      ~ arn                       = "arn:aws:autoscaling:us-east-1:619568494776:autoScalingGroup:12bb0a68-eb61-485e-88f9-33c5e8c4df3b:autoScalingGroupName/prod-remix-recipe-auto-scaling-group" -> (known after apply)
      ~ availability_zones        = [
          - "us-east-1a",
          - "us-east-1b",
          - "us-east-1c",
          - "us-east-1d",
          - "us-east-1e",
          - "us-east-1f",
        ] -> (known after apply)
      - capacity_rebalance        = false -> null
      ~ default_cooldown          = 300 -> (known after apply)
      - enabled_metrics           = [] -> null
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "prod-remix-recipe-auto-scaling-group" -> (known after apply)
      ~ launch_configuration      = "prod-remix-recipe-launch-configuration" -> (known after apply)
      - load_balancers            = [
          - "prod-remix-recipe-load-balancer",
        ] -> null
      - max_instance_lifetime     = 0 -> null
      ~ name                      = "prod-remix-recipe-auto-scaling-group" -> (known after apply)
      + name_prefix               = "prod-remix-recipe-auto-scaling-group-" # forces replacement
      ~ service_linked_role_arn   = "arn:aws:iam::619568494776:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes       = [] -> null
      - target_group_arns         = [] -> null
      - termination_policies      = [] -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_launch_configuration.alc must be replaced
+/- resource "aws_launch_configuration" "alc" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:619568494776:launchConfiguration:66eb9eac-5fa1-4531-b851-6c203db545fa:launchConfigurationName/prod-remix-recipe-launch-configuration" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "prod-remix-recipe-launch-configuration" -> (known after apply)
      + key_name                         = (known after apply)
      ~ name                             = "prod-remix-recipe-launch-configuration" -> (known after apply)
      + name_prefix                      = "prod-remix-recipe-launch-configuration-" # forces replacement
      ~ user_data                        = "a5c6997d7f3cd2eab1343c784e170c329a144781" -> "0936e884e947bbf223d7364968a54714343df822" # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (6 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      ~ root_block_device {
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 0 -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @shubhamcommits, Action: `pull_request`*